Tekla.Structures.Forming.FoldingType
Enumeration for folding type.

Tekla.Structures.Forming.FoldingType.NOT_SPECIFIED
Not specified, default value.

Tekla.Structures.Forming.FoldingType.FOLDED
Indicates folded item.

Tekla.Structures.Forming.FoldingType.UNFOLDED
Indicates unfolded item.